// Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, 
// и проверяет,  является ли этот день выходным.

int i = int.Parse(Console.ReadLine());
System.Console.WriteLine(Введите число (i = 1, ..., 7)); 

  if (i = 6 || 7)
    { 
    System.Console.WriteLine ("День выходной");
    }
  else 
    {
    System.Console.WriteLine ("День не выходной");
    } 

